bishi-eava/esp-mp4player/sdkconfig.defaults.atoms3r
# ESP32-S3 Movie Player sdkconfig defaults (Atom S3R)
# board = m5stack-atoms3

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- PSRAM (Octal SPI — ESP32-S3-PICO-1-N8R8 internal PSRAM requires Octal mode) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384

# --- Flash (8MB, DIO to match board default) ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- Main task stack (H.264 decoder needs more stack) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# --- SPI DMA ---
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# --- Log level ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- FreeRTOS runtime stats (CPU load monitoring) ---
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
